zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_canfd.c
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_canfd.c
  * @author  FMSH Application Team
  * @brief   Source file of CANFD FL Module
  *******************************************************************************************************   
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Includes ------------------------------------------------------------------*/
#include "fm33fg0xxa_fl.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */

/** @addtogroup CANFD
  * @{
  */

#ifdef FL_CANFD_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup CANFD_FL_Private_Macros
  * @{
  */


#define     IS_CANFD_INSTANCE(INSTANCE)                 (((INSTANCE) == CANFD0) ||\
                                                          ((INSTANCE) == CANFD1))
                                                          
#define     IS_CANFD_GLOBAL_MODE(__VALUE__)             (((__VALUE__) == FL_CANFD_GLOBAL_MODE_OPERATION)    ||\
                                                          ((__VALUE__) == FL_CANFD_GLOBAL_MODE_RESET)       ||\
                                                          ((__VALUE__) == FL_CANFD_GLOBAL_MODE_HALT)        ||\
                                                          ((__VALUE__) == FL_CANFD_GLOBAL_MODE_KEEP_CURRENT))                                                         
                                                          
#define     IS_CANFD_CHANNEL_MODE(__VALUE__)            (((__VALUE__) == FL_CANFD_CHANNEL_MODE_OPERATION)  ||\
                                                          ((__VALUE__) == FL_CANFD_CHANNEL_MODE_RESET)      ||\
                                                          ((__VALUE__) == FL_CANFD_CHANNEL_MODE_HALT)       ||\
                                                          ((__VALUE__) == FL_CANFD_CHANNEL_MODE_KEEP_CURRENT))                                                          
                                                         
#define     IS_CANFD_NB_SJW(__VALUE__)                  ((__VALUE__) <= 0x7FU)
                                                         
#define     IS_CANFD_NB_TS1(__VALUE__)                  (((__VALUE__) > 0U) &&\
                                                          ((__VALUE__) <= 0xFFU))
                                                          
#define     IS_CANFD_NB_TS2(__VALUE__)                  (((__VALUE__) > 0U) &&\
                                                          ((__VALUE__) <= 0x7FU))

#define     IS_CANFD_DB_SJW(__VALUE__)                  ((__VALUE__) <= 0x0FU)
                                                         
#define     IS_CANFD_DB_TS1(__VALUE__)                  (((__VALUE__) > 0U) &&\
                                                          ((__VALUE__) <= 0x1FU))
                                                          
#define     IS_CANFD_DB_TS2(__VALUE__)                  (((__VALUE__) > 0) &&\
                                                          ((__VALUE__) <= 0x0FU))
                                                         
#define     IS_CANFD0_CLOCK_SOURCE(__VALUE__)           (((__VALUE__) == FL_CMU_CANFD0_CLK_SOURCE_APBCLK)   ||\
                                                          ((__VALUE__) == FL_CMU_CANFD0_CLK_SOURCE_XTHF)    ||\
                                                          ((__VALUE__) == FL_CMU_CANFD0_CLK_SOURCE_PLL)     ||\
                                                          ((__VALUE__) == FL_CMU_CANFD0_CLK_SOURCE_RCHF))
                                                          
#define     IS_CANFD1_CLOCK_SOURCE(__VALUE__)           (((__VALUE__) == FL_CMU_CANFD1_CLK_SOURCE_APBCLK)  ||\
                                                          ((__VALUE__) == FL_CMU_CANFD1_CLK_SOURCE_XTHF)    ||\
                                                          ((__VALUE__) == FL_CMU_CANFD1_CLK_SOURCE_PLL)     ||\
                                                          ((__VALUE__) == FL_CMU_CANFD1_CLK_SOURCE_RCHF))

#define     IS_CANFD0_CLOCK_SOURCE_RAM(__VALUE__)       (((__VALUE__) == FL_CMU_CANFD0_CLK_SOURCE_RAM_AHBCLK)  ||\
                                                          ((__VALUE__) == FL_CMU_CANFD0_CLK_SOURCE_RAM_PLL_VCO))
                                                          
