zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_canfd.c
#define     IS_CANFD1_CLOCK_SOURCE_RAM(__VALUE__)       (((__VALUE__) == FL_CMU_CANFD1_CLK_SOURCE_RAM_AHBCLK)  ||\
                                                          ((__VALUE__) == FL_CMU_CANFD1_CLK_SOURCE_RAM_PLL_VCO))

#define     IS_CANFD_RXMB_PLS(__VALUE__)                (((__VALUE__) == FL_CANFD_RMPLS_SIZE_8)     ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_12)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_16)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_20)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_24)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_32)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_48)   ||\
                                                          ((__VALUE__) == FL_CANFD_RMPLS_SIZE_64))
                                                          
#define     IS_CANFD_RXMB_NUM(__VALUE__)                (((__VALUE__) <= 32U))                                                          
                                                          
#define     IS_CANFD_RXFIFO_IGCV(__VALUE__)             (((__VALUE__) == FL_CANFD_RFIGCV_1P8_FULL)  ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_1P4_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_3P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_1P2_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_5P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_3P4_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_7P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIGCV_FULL))

#define     IS_CANFD_RXFIFO_IM(__VALUE__)               (((__VALUE__) == FL_CANFD_RFIM_REACH_RFIGCV)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFIM_EVERY_MESSAGE))
                                                          
#define     IS_CANFD_RXFIFO_DC(__VALUE__)               (((__VALUE__) == FL_CANFD_RFDC_DEPTH_0)     ||\
                                                          ((__VALUE__) == FL_CANFD_RFDC_DEPTH_4)    ||\
                                                          ((__VALUE__) == FL_CANFD_RFDC_DEPTH_8)    ||\
                                                          ((__VALUE__) == FL_CANFD_RFDC_DEPTH_16)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFDC_DEPTH_32)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFDC_DEPTH_48))

#define     IS_CANFD_RXFIFO_PLS(__VALUE__)              (((__VALUE__) == FL_CANFD_RFPLS_SIZE_8)     ||\
                                                          ((__VALUE__) == FL_CANFD_RFPLS_SIZE_12)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFPLS_SIZE_16)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFPLS_SIZE_20)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFPLS_SIZE_24)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFPLS_SIZE_32)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFPLS_SIZE_48)   ||\
                                                          ((__VALUE__) == FL_CANFD_RFPLS_SIZE_64))
                                                          
#define     IS_CANFD_COMMONFIFO_DC(__VALUE__)           (((__VALUE__) == FL_CANFD_CFDC_DEPTH_0)     ||\
                                                          ((__VALUE__) == FL_CANFD_CFDC_DEPTH_4)    ||\
                                                          ((__VALUE__) == FL_CANFD_CFDC_DEPTH_8)    ||\
                                                          ((__VALUE__) == FL_CANFD_CFDC_DEPTH_16)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFDC_DEPTH_32)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFDC_DEPTH_48))

#define     IS_CANFD_COMMONFIFO_TML(__VALUE__)          (((__VALUE__) == FL_CANFD_CFTML_TXMB0)  ||\
                                                          ((__VALUE__) == FL_CANFD_CFTML_TXMB1) ||\
                                                          ((__VALUE__) == FL_CANFD_CFTML_TXMB2) ||\
                                                          ((__VALUE__) == FL_CANFD_CFTML_TXMB3))
                                                          
#define     IS_CANFD_COMMONFIFO_IGCV(__VALUE__)         (((__VALUE__) == FL_CANFD_CFIGCV_1P8_FULL)  ||\
                                                          ((__VALUE__) == FL_CANFD_CFIGCV_1P4_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFIGCV_3P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFIGCV_1P2_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFIGCV_5P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFIGCV_3P4_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFIGCV_7P8_FULL)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFIGCV_FULL))

#define     IS_CANFD_COMMONFIFO_IM(__VALUE__)           (((__VALUE__) == FL_CANFD_CFIM_REACH_RFIGCV)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFIM_EVERY_MESSAGE))
                                                          
