zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_canfd.c
#define     IS_CANFD_COMMONFIFO_ITR(__VALUE__)          (((__VALUE__) == FL_CANFD_CFITR_REF_CLOCK_MUL_1)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFITR_REF_CLOCK_MUL_10))

#define     IS_CANFD_COMMONFIFO_ITSS(__VALUE__)         (((__VALUE__) == FL_CANFD_CFITSS_REF_CLOCK)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFITSS_BIT_CLOCK))

#define     IS_CANFD_COMMONFIFO_MODE(__VALUE__)         (((__VALUE__) == FL_CANFD_CFM_RX_FIFO)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFM_TX_FIFO))
                                                          
#define     IS_CANFD_COMMONFIFO_PLS(__VALUE__)          (((__VALUE__) == FL_CANFD_CFPLS_SIZE_8)     ||\
                                                          ((__VALUE__) == FL_CANFD_CFPLS_SIZE_12)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFPLS_SIZE_16)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFPLS_SIZE_20)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFPLS_SIZE_24)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFPLS_SIZE_32)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFPLS_SIZE_48)   ||\
                                                          ((__VALUE__) == FL_CANFD_CFPLS_SIZE_64))                                                          
                                                          
#define     IS_CANFD_TXQUEUE_DC(__VALUE__)              (((__VALUE__) == FL_CANFD_TXQDC_DEPTH_0)    ||\
                                                          ((__VALUE__) == FL_CANFD_TXQDC_DEPTH_3)   ||\
                                                          ((__VALUE__) == FL_CANFD_TXQDC_DEPTH_4))                                                          
                                                          
#define     IS_CANFD_TXQUEUE_IM(__VALUE__)              (((__VALUE__) == FL_CANFD_TXQIM_LAST_MESSAGE_TRANSMITTED)   ||\
                                                          ((__VALUE__) == FL_CANFD_TXQIM_EVERY_TRANSMISSION))                                                          
                                                          
#define     IS_CANFD_TXHISTORYLIST_IM(__VALUE__)        (((__VALUE__) == FL_CANFD_THLIM_REACH_3P4_DEPTH)   ||\
                                                          ((__VALUE__) == FL_CANFD_THLIM_EVERY_TRANSMISSION))

#define     IS_CANFD_GAFL_PAGE_NUM(__VALUE__)           (((__VALUE__) == FL_CANFD_GAFL_PAGE_NUMBER_FIRST)    ||\
                                                         ((__VALUE__) == FL_CANFD_GAFL_PAGE_NUMBER_SECOND))

#define     IS_CANFD_GAFL_RULE_NUM(__VALUE__)           (((__VALUE__) <= 32U))
                                                          
#define     IS_CANFD_GAFL_IDE(__VALUE__)                (((__VALUE__) == FL_CANFD_GAFL_IDE_STANDARD)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_IDE_EXTENDED))

#define     IS_CANFD_GAFL_RTR(__VALUE__)                (((__VALUE__) == FL_CANFD_GAFL_RTR_DATA_FRAME)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_RTR_REMOTE_FRAME))
                                                          
#define     IS_CANFD_GAFL_IDEM(__VALUE__)               (((__VALUE__) == FL_CANFD_GAFL_IDEM_NOT_CONSIDERED)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_IDEM_CONSIDERED))

#define     IS_CANFD_GAFL_RTRM(__VALUE__)               (((__VALUE__) == FL_CANFD_GAFL_RTRM_NOT_CONSIDERED)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_RTRM_CONSIDERED))

#define     IS_CANFD_GAFL_SINGLE_RXMB(__VALUE__)        (((__VALUE__) == FL_CANFD_GAFL_SINGLE_RXMB_INVALID)   ||\
                                                          ((__VALUE__) == FL_CANFD_GAFL_SINGLE_RXMB_VALID))
                                                          
#define     IS_CANFD_GAFL_RXMB_NUM(__VALUE__)           ((__VALUE__) <= FL_CANFD_RXMB31)                                    
            
#define     IS_CANFD_TX_PRIORITY(__VALUE__)             (((__VALUE__) == FL_CANFD_TX_PRIORITY_ID) ||\
                                                          ((__VALUE__) == FL_CANFD_TX_PRIORITY_BUFFER))
                                                          
#define     IS_CANFD_ESI_CFG(__VALUE__)                 (((__VALUE__) == FL_CANFD_ESI_CONFIGURATION_NODE_STATE) ||\
                                                          ((__VALUE__) == FL_CANFD_ESI_CONFIGURATION_SOFTWARE))
                                                          
#define     IS_CANFD_TDCO_CFG(__VALUE__)                (((__VALUE__) == FL_CANFD_TDCO_CONFIGURATION_MEASURED_WITH_OFFSET) ||\
                                                          ((__VALUE__) == FL_CANFD_TDCO_CONFIGURATION_OFFSET))
                                                          
#define     IS_CANFD_FUNSTATE_TYPE(__VALUE__)           (((__VALUE__) == FL_DISABLE) ||\
                                                          ((__VALUE__) == FL_ENABLE))
/**
  * @}
  */

/* Private consts ------------------------------------------------------------*/
/** @addtogroup CANFD_FL_Private_Consts
  * @{
  */

const uint8_t RXMB_INDEX_START[4] = {0, 8, 16, 24};

const CANFD_BUFFER_TYPE CANFD_BUFFER[] = 
{
    /* CANFD0 */
    {CANFD0_RX_FIFO, CANFD0_COMMON_FIFO, CANFD0_TX_MESSAGE, CANFD0_TX_HISTORY_LIST, \
    {CANFD0_RX_MESSAGE0, CANFD0_RX_MESSAGE1, CANFD0_RX_MESSAGE2, CANFD0_RX_MESSAGE3}},
    
    /* CANFD1 */
    {CANFD1_RX_FIFO, CANFD1_COMMON_FIFO, CANFD1_TX_MESSAGE, CANFD1_TX_HISTORY_LIST, \
    {CANFD1_RX_MESSAGE0, CANFD1_RX_MESSAGE1, CANFD1_RX_MESSAGE2, CANFD1_RX_MESSAGE3}}
};

/**
  * @}
  */

