zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_canfd.c
/* Private function prototypes -----------------------------------------------*/



/* Exported functions --------------------------------------------------------*/
/** @addtogroup CANFD_FL_EF_Init
  * @{
  */

/**
  * @brief  CANFD初始化
  * @param  CANFDx外设入口地址
  * @param  CANFD_InitStruct 指向一个@ref FL_CANFD_InitTypeDef  结构体的指针
  * @retval 错误状态可能值
  *         -FL_FAIL 配置过程发生错误
  *         -FL_PASS 配置成功
  */
FL_ErrorStatus FL_CANFD_Init(CANFD_COMMON_Type *CANFDx, FL_CANFD_InitTypeDef *CANFD_InitStruct)
{
    uint8_t i, index;
    FL_ErrorStatus status = FL_FAIL;
    
    if(CANFD_InitStruct != NULL)
    {
        /*参数检查*/
        assert_param(IS_CANFD_INSTANCE(CANFDx));
        
        /*全局模式和通道模式检查*/
        assert_param(IS_CANFD_GLOBAL_MODE(CANFD_InitStruct->globalMode));
        assert_param(IS_CANFD_CHANNEL_MODE(CANFD_InitStruct->channelMode));
        
        if ((CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_RESET) &&\
            (CANFD_InitStruct->channelMode != FL_CANFD_CHANNEL_MODE_RESET))
        {
            return FL_FAIL;
        }
        
        /* 位速率参数检查 */
        assert_param(IS_CANFD_NB_SJW(CANFD_InitStruct->NB_SJW));
        assert_param(IS_CANFD_NB_TS1(CANFD_InitStruct->NB_TS1));
        assert_param(IS_CANFD_NB_TS2(CANFD_InitStruct->NB_TS2));
        assert_param(IS_CANFD_DB_SJW(CANFD_InitStruct->DB_SJW));
        assert_param(IS_CANFD_DB_TS1(CANFD_InitStruct->DB_TS1));
        assert_param(IS_CANFD_DB_TS2(CANFD_InitStruct->DB_TS2));
        
        /* 时钟源检查 */
        if (CANFDx == CANFD0)
        {
            assert_param(IS_CANFD0_CLOCK_SOURCE(CANFD_InitStruct->clockSource));
            assert_param(IS_CANFD0_CLOCK_SOURCE_RAM(CANFD_InitStruct->clockSourceRAM));
        }
        else
        {
            assert_param(IS_CANFD1_CLOCK_SOURCE(CANFD_InitStruct->clockSource));
            assert_param(IS_CANFD1_CLOCK_SOURCE_RAM(CANFD_InitStruct->clockSourceRAM));            
        }
        
        /* RxMB参数检查 */
        assert_param(IS_CANFD_RXMB_PLS(CANFD_InitStruct->rxmbCfg.payloadDataSize));
        assert_param(IS_CANFD_RXMB_NUM(CANFD_InitStruct->rxmbCfg.rxmbNum));
        
        /* RxFIFO参数检查 */
        for (i = 0; i < 2; i++)
        {
            if (CANFD_InitStruct->rxfifoCfg[i].Enable == FL_ENABLE)
            {
                assert_param(IS_CANFD_RXFIFO_IGCV(CANFD_InitStruct->rxfifoCfg[i].intGenCounterValue));
                assert_param(IS_CANFD_RXFIFO_IM(CANFD_InitStruct->rxfifoCfg[i].intMode));
                assert_param(IS_CANFD_RXFIFO_DC(CANFD_InitStruct->rxfifoCfg[i].fifoDepth));
                assert_param(IS_CANFD_RXFIFO_PLS(CANFD_InitStruct->rxfifoCfg[i].payloadDataSize));
            }
        }
        
        /* CommonFIFO参数检查 */
        if (CANFD_InitStruct->commonfifoCfg.Enable == FL_ENABLE)
        {
            assert_param(IS_CANFD_COMMONFIFO_DC(CANFD_InitStruct->commonfifoCfg.fifoDepth));
            assert_param(IS_CANFD_COMMONFIFO_TML(CANFD_InitStruct->commonfifoCfg.txmbLink));
            assert_param(IS_CANFD_COMMONFIFO_IGCV(CANFD_InitStruct->commonfifoCfg.intGenCounterValue));
            assert_param(IS_CANFD_COMMONFIFO_IM(CANFD_InitStruct->commonfifoCfg.intMode));
            assert_param(IS_CANFD_COMMONFIFO_ITR(CANFD_InitStruct->commonfifoCfg.intervalTimerResolution));
            assert_param(IS_CANFD_COMMONFIFO_ITSS(CANFD_InitStruct->commonfifoCfg.intervalTimerSource));
            assert_param(IS_CANFD_COMMONFIFO_MODE(CANFD_InitStruct->commonfifoCfg.fifoMode));
            assert_param(IS_CANFD_COMMONFIFO_PLS(CANFD_InitStruct->commonfifoCfg.payloadDataSize));
        }
        
        /* TxQueue参数检查 */
        if (CANFD_InitStruct->txqueueCfg.Enable == FL_ENABLE)
        {
            assert_param(IS_CANFD_TXQUEUE_DC(CANFD_InitStruct->txqueueCfg.queueDepth));
            assert_param(IS_CANFD_TXQUEUE_IM(CANFD_InitStruct->txqueueCfg.intMode));
        }
        
        /* CommonFIFO和TxQueue参数冲突检查 */
        if (CANFD_InitStruct->commonfifoCfg.fifoMode == FL_CANFD_CFM_TX_FIFO)
        {
            if ((CANFD_InitStruct->txqueueCfg.queueDepth == FL_CANFD_TXQDC_DEPTH_4) ||\
                ((CANFD_InitStruct->txqueueCfg.queueDepth == FL_CANFD_TXQDC_DEPTH_3) && (CANFD_InitStruct->commonfifoCfg.txmbLink != FL_CANFD_CFTML_TXMB3)))
            {
                return FL_FAIL;
            }
        }

        /* TxHistoryList参数检查 */
        if (CANFD_InitStruct->txHistoryCfg.Enable == FL_ENABLE)
        {
            assert_param(IS_CANFD_TXHISTORYLIST_IM(CANFD_InitStruct->txHistoryCfg.intMode));
        }
        
        /* AcceptanceFilterList参数检查 */
        assert_param(IS_CANFD_GAFL_RULE_NUM(CANFD_InitStruct->acceptanceFilterRuleNum));
        for (i = 0; i < 32; i++)
        {
            if (CANFD_InitStruct->acceptanceFilterCfg[i].filterEnable == FL_ENABLE)
            {
                assert_param(IS_CANFD_GAFL_IDE(CANFD_InitStruct->acceptanceFilterCfg[i].filterIDE));
                assert_param(IS_CANFD_GAFL_RTR(CANFD_InitStruct->acceptanceFilterCfg[i].filterRTR));
                assert_param(IS_CANFD_GAFL_IDEM(CANFD_InitStruct->acceptanceFilterCfg[i].filterIDEMask));
                assert_param(IS_CANFD_GAFL_RTRM(CANFD_InitStruct->acceptanceFilterCfg[i].filterRTRMask));
                assert_param(IS_CANFD_GAFL_SINGLE_RXMB(CANFD_InitStruct->acceptanceFilterCfg[i].rxmbValid));
                assert_param(IS_CANFD_GAFL_RXMB_NUM(CANFD_InitStruct->acceptanceFilterCfg[i].rxmbNum));
            }
        }
        
        /* 特殊参数检查 */
        assert_param(IS_CANFD_TX_PRIORITY(CANFD_InitStruct->txPriority));
        assert_param(IS_CANFD_ESI_CFG(CANFD_InitStruct->esiCfg));
        assert_param(IS_CANFD_TDCO_CFG(CANFD_InitStruct->tdcoCfg));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->tdcoEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->respedEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->dlcCheckEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->dlcReplacementEnable));
        assert_param(IS_CANFD_FUNSTATE_TYPE(CANFD_InitStruct->messageIsRejected));
        
