zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Src/fm33fg0xxa_fl_canfd.c
        if (CANFD_InitStruct->messageIsRejected == FL_ENABLE)
        {
            FL_CANFD_Global_SetCANFDMessagePayloadOverflowConfiguration(CANFDx, FL_CANFD_CMPOC_CONFIGURATION_REJECTED);
        }
        else
        {
            FL_CANFD_Global_SetCANFDMessagePayloadOverflowConfiguration(CANFDx, FL_CANFD_CMPOC_CONFIGURATION_CUTOFF);
        }
        
        /*模式配置*/
        if (CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_OPERATION)
        {
            FL_CANFD_Global_SetGlobalMode(CANFDx, FL_CANFD_GLOBAL_MODE_OPERATION);            
        }
        else if (CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_RESET)
        {
            FL_CANFD_Global_SetGlobalMode(CANFDx, FL_CANFD_GLOBAL_MODE_RESET);            
        }
        else if (CANFD_InitStruct->globalMode == FL_CANFD_GLOBAL_MODE_HALT)
        {
            FL_CANFD_Global_SetGlobalMode(CANFDx, FL_CANFD_GLOBAL_MODE_HALT);            
        }
        
        if (CANFD_InitStruct->channelMode == FL_CANFD_CHANNEL_MODE_OPERATION)
        {
            FL_CANFD_CH0_SetChannelMode(CANFDx, FL_CANFD_CHANNEL_MODE_OPERATION);
            while (FL_CANFD_CH0_IsActiveFlag_SleepStatus(CANFDx) || 
                   FL_CANFD_CH0_IsActiveFlag_HaltStatus(CANFDx)  || 
                   FL_CANFD_CH0_IsActiveFlag_ResetStatus(CANFDx))
            {
                /* 直至看门狗溢出复位 */
            }
        }
        else if (CANFD_InitStruct->channelMode == FL_CANFD_CHANNEL_MODE_RESET)
        {
            FL_CANFD_CH0_SetChannelMode(CANFDx, FL_CANFD_CHANNEL_MODE_RESET);
            while (!FL_CANFD_CH0_IsActiveFlag_ResetStatus(CANFDx))
            {
                /* 直至看门狗溢出复位 */
            }
        }
        else if (CANFD_InitStruct->channelMode == FL_CANFD_CHANNEL_MODE_HALT)
        {
            FL_CANFD_CH0_SetChannelMode(CANFDx, FL_CANFD_CHANNEL_MODE_HALT);
            while (!FL_CANFD_CH0_IsActiveFlag_HaltStatus(CANFDx))
            {
                /* 直至看门狗溢出复位 */
            }
        }        
        
        /*使能Buffer*/
        if (!FL_CANFD_CH0_IsActiveFlag_SleepStatus(CANFDx) &&
            !FL_CANFD_CH0_IsActiveFlag_ResetStatus(CANFDx))
        {
            /* 配置RxFIFO */
            for (i = 0; i < 2; i++)
            {
                if (CANFD_InitStruct->rxfifoCfg[i].Enable == FL_ENABLE)
                {
                    FL_CANFD_Global_Enable_RxFIFO(CANFDx, i);
                }
            }

            /* 配置CommonFIFO */
            if (CANFD_InitStruct->commonfifoCfg.Enable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_CommonFIFO(CANFDx);
            }

            /* 配置TxQueue */
            if (CANFD_InitStruct->txqueueCfg.Enable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_TxQueue(CANFDx);
            }
            
            /* 配置TxHistoryList */
            if (CANFD_InitStruct->txHistoryCfg.Enable == FL_ENABLE)
            {
                FL_CANFD_Global_Enable_TxHistoryList(CANFDx);
            }            
        }
        
        status = FL_PASS;
    }
    
    return status;
}

/**
  * @brief  设置 CANFD_InitStruct 为默认模式
  * @param  CANFD_InitStruct 指向需要将值设置为默认配置的结构体 @ref FL_CANFD_InitTypeDef 结构体
  *
  * @retval None
  */
void FL_CANFD_StructInit(CANFD_COMMON_Type *CANFDx, FL_CANFD_InitTypeDef *CANFD_InitStruct)
{
    if(CANFD_InitStruct != NULL)
    {
        /* 配置CANFD初始化参数 */
        CANFD_InitStruct->globalMode = FL_CANFD_GLOBAL_MODE_OPERATION;
        CANFD_InitStruct->channelMode = FL_CANFD_CHANNEL_MODE_OPERATION;
        
        CANFD_InitStruct->NB_SJW = 2; /* 标称位速率配置 */
        CANFD_InitStruct->NB_TS1 = 10;
        CANFD_InitStruct->NB_TS2 = 3;
        CANFD_InitStruct->NB_BRP = 3;
        CANFD_InitStruct->DB_SJW = 2; /* 数据位速率配置 */
        CANFD_InitStruct->DB_TS1 = 10;
        CANFD_InitStruct->DB_TS2 = 3;
        CANFD_InitStruct->DB_BRP = 3;
        
        if (CANFDx == CANFD0)   /* 通信时钟和RAM时钟选择 */
        {
            CANFD_InitStruct->clockSource = FL_CMU_CANFD0_CLK_SOURCE_PLL;
            CANFD_InitStruct->clockSourceRAM = FL_CMU_CANFD0_CLK_SOURCE_RAM_PLL_VCO;
        }
        else if (CANFDx == CANFD1)
        {
            CANFD_InitStruct->clockSource = FL_CMU_CANFD1_CLK_SOURCE_PLL;
            CANFD_InitStruct->clockSourceRAM = FL_CMU_CANFD1_CLK_SOURCE_RAM_PLL_VCO;
        }
        
        /* RxMB配置 */
        CANFD_InitStruct->rxmbCfg.payloadDataSize = FL_CANFD_RMPLS_SIZE_8;
        CANFD_InitStruct->rxmbCfg.rxmbNum = 1;
        /* RxFIFO配置 */
        CANFD_InitStruct->rxfifoCfg[0].intGenCounterValue = FL_CANFD_RFIGCV_FULL;
        CANFD_InitStruct->rxfifoCfg[0].intMode = FL_CANFD_RFIM_EVERY_MESSAGE;
        CANFD_InitStruct->rxfifoCfg[0].fifoDepth = FL_CANFD_RFDC_DEPTH_8;
        CANFD_InitStruct->rxfifoCfg[0].payloadDataSize = FL_CANFD_RFPLS_SIZE_8;
        CANFD_InitStruct->rxfifoCfg[0].intEnable = FL_DISABLE;
        CANFD_InitStruct->rxfifoCfg[0].Enable = FL_ENABLE;
        
        CANFD_InitStruct->rxfifoCfg[1].intGenCounterValue = FL_CANFD_RFIGCV_FULL;
        CANFD_InitStruct->rxfifoCfg[1].intMode = FL_CANFD_RFIM_EVERY_MESSAGE;
        CANFD_InitStruct->rxfifoCfg[1].fifoDepth = FL_CANFD_RFDC_DEPTH_8;
        CANFD_InitStruct->rxfifoCfg[1].payloadDataSize = FL_CANFD_RFPLS_SIZE_8;
        CANFD_InitStruct->rxfifoCfg[1].intEnable = FL_DISABLE;
        CANFD_InitStruct->rxfifoCfg[1].Enable = FL_ENABLE;
        /* CommonFIFO配置 */
        CANFD_InitStruct->commonfifoCfg.txInterval = 0;
        CANFD_InitStruct->commonfifoCfg.fifoDepth = FL_CANFD_CFDC_DEPTH_8;
        CANFD_InitStruct->commonfifoCfg.txmbLink = FL_CANFD_CFTML_TXMB3;
        CANFD_InitStruct->commonfifoCfg.intGenCounterValue = FL_CANFD_CFIGCV_FULL;
        CANFD_InitStruct->commonfifoCfg.intMode = FL_CANFD_CFIM_EVERY_MESSAGE;
        CANFD_InitStruct->commonfifoCfg.intervalTimerResolution = FL_CANFD_CFITR_REF_CLOCK_MUL_1;
        CANFD_InitStruct->commonfifoCfg.intervalTimerSource = FL_CANFD_CFITSS_REF_CLOCK;
        CANFD_InitStruct->commonfifoCfg.fifoMode = FL_CANFD_CFM_RX_FIFO;
        CANFD_InitStruct->commonfifoCfg.payloadDataSize = FL_CANFD_CFPLS_SIZE_8;
        CANFD_InitStruct->commonfifoCfg.intEnable = FL_DISABLE;
        CANFD_InitStruct->commonfifoCfg.Enable = FL_ENABLE;
        /* TxQueue配置 */
        CANFD_InitStruct->txqueueCfg.queueDepth = FL_CANFD_TXQDC_DEPTH_3;
        CANFD_InitStruct->txqueueCfg.intMode = FL_CANFD_TXQIM_EVERY_TRANSMISSION;
        CANFD_InitStruct->txqueueCfg.intEnable = FL_DISABLE;
        CANFD_InitStruct->txqueueCfg.Enable = FL_DISABLE;
        /* TxHistoryList配置 */
        CANFD_InitStruct->txHistoryCfg.dedicatedTxEnable = FL_ENABLE;
        CANFD_InitStruct->txHistoryCfg.intMode = FL_CANFD_THLIM_EVERY_TRANSMISSION;
        CANFD_InitStruct->txHistoryCfg.intEnable = FL_DISABLE;
        CANFD_InitStruct->txHistoryCfg.Enable = FL_DISABLE;
        
        /* 接收滤波器配置 */
        CANFD_InitStruct->acceptanceFilterRuleNum = 1;
        CANFD_InitStruct->acceptanceFilterCfg[0].filterIDE = FL_CANFD_GAFL_IDE_STANDARD;
        CANFD_InitStruct->acceptanceFilterCfg[0].filterRTR = FL_CANFD_GAFL_RTR_DATA_FRAME;
        CANFD_InitStruct->acceptanceFilterCfg[0].filterID = 0x6AD;
        CANFD_InitStruct->acceptanceFilterCfg[0].filterIDEMask = FL_CANFD_GAFL_IDEM_CONSIDERED;
        CANFD_InitStruct->acceptanceFilterCfg[0].filterRTRMask = FL_CANFD_GAFL_RTRM_CONSIDERED;
        CANFD_InitStruct->acceptanceFilterCfg[0].filterIDMask = 0x1FFFFFFF;
        CANFD_InitStruct->acceptanceFilterCfg[0].rxmbValid = FL_CANFD_GAFL_SINGLE_RXMB_VALID;
        CANFD_InitStruct->acceptanceFilterCfg[0].rxmbNum = FL_CANFD_RXMB0;
        CANFD_InitStruct->acceptanceFilterCfg[0].dlc = 8;
        CANFD_InitStruct->acceptanceFilterCfg[0].commonfifoRecvEnable = FL_ENABLE;
        CANFD_InitStruct->acceptanceFilterCfg[0].rxfifo0RecvEnable = FL_ENABLE;
        CANFD_InitStruct->acceptanceFilterCfg[0].rxfifo1RecvEnable = FL_ENABLE;
        CANFD_InitStruct->acceptanceFilterCfg[0].filterEnable = FL_ENABLE;
        
        /* 特殊参数配置 */
        CANFD_InitStruct->txPriority = FL_CANFD_TX_PRIORITY_ID;   /* 发送优先级 */
        CANFD_InitStruct->esiCfg = FL_CANFD_ESI_CONFIGURATION_SOFTWARE; /* ESI配置 */
        CANFD_InitStruct->tdco = 12; /* TDCO配置 */
        CANFD_InitStruct->tdcoCfg = FL_CANFD_TDCO_CONFIGURATION_MEASURED_WITH_OFFSET;/* TDCO模式配置 */
        CANFD_InitStruct->tdcoEnable = FL_ENABLE;
    }
}

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup CANFD_FL_Private_Functions CAN Private Functions
  * @{
  */

/**
  * @}
  */

#endif /* FL_CANFD_DRIVER_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/

